EDT/ZUP/zup_edt/src/InformationRegisters/КлассификаторыРекрутинговыхСайтов/КлассификаторыРекрутинговыхСайтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлассификаторыРекрутинговыхСайтов</name>
  <resources>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Сайт</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяКлассификатора</name>
    <type>
      <types>EnumRef.ИменаКлассификаторовРекрутинговыхСайтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/InformationRegisters/КлассификаторыРекрутинговыхСайтов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьКлассификатор(Сайт, ИмяКлассификатора, Значение, ДатаАктуальности = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.КлассификаторыРекрутинговыхСайтов.СоздатьМенеджерЗаписи();
	Запись.Сайт = Сайт;
	Запись.ИмяКлассификатора = ИмяКлассификатора;
	Запись.ДатаАктуальности = ?(ДатаАктуальности = Неопределено, НачалоДня(ТекущаяДатаСеанса()), ДатаАктуальности);
	Запись.Значение = Новый ХранилищеЗначения(Значение);
	Запись.Записать(Истина);
	
КонецПроцедуры

Функция УстаревшиеКлассификаторы(Сайт, Знач ИменаКлассификаторов) Экспорт
	
	Если Не ЗначениеЗаполнено(ИменаКлассификаторов) Тогда
		Возврат ИменаКлассификаторов;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КлассификаторыРекрутинговыхСайтов.ИмяКлассификатора КАК ИмяКлассификатора
	|ИЗ
	|	РегистрСведений.КлассификаторыРекрутинговыхСайтов КАК КлассификаторыРекрутинговыхСайтов
	|ГДЕ
	|	КлассификаторыРекрутинговыхСайтов.Сайт = &Сайт
	|	И КлассификаторыРекрутинговыхСайтов.ДатаАктуальности >= &ДатаАктуальности");
	Запрос.УстановитьПараметр("Сайт", Сайт);
	Запрос.УстановитьПараметр("ДатаАктуальности", НачалоДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ИменаКлассификаторов;
	КонецЕсли;
	
	АктуальныеКлассификаторы = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИмяКлассификатора");
	Для Каждого Классификатор Из АктуальныеКлассификаторы Цикл
		Индекс = ИменаКлассификаторов.Найти(Классификатор);
		Если Индекс = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ИменаКлассификаторов.Удалить(Индекс);
	КонецЦикла;
	
	Возврат ИменаКлассификаторов;
	
КонецФункции

Функция ЗначениеКлассификатора(Сайт, ИмяКлассификатора) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КлассификаторыРекрутинговыхСайтов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.КлассификаторыРекрутинговыхСайтов КАК КлассификаторыРекрутинговыхСайтов
	|ГДЕ
	|	КлассификаторыРекрутинговыхСайтов.Сайт = &Сайт
	|	И КлассификаторыРекрутинговыхСайтов.ИмяКлассификатора = &ИмяКлассификатора");
	Запрос.УстановитьПараметр("Сайт", Сайт);
	Запрос.УстановитьПараметр("ИмяКлассификатора", ИмяКлассификатора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Значение.Получить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
